#!/usr/bin/python
# enconding: utf-8

"""
@author:merrickzhang
@contact: merrickzhang@126.com
@file: 006.py
@time: 2016/11/6 18:48
"""

>>> a = 5
>>> a = a + 3
>>> a += 3
>>> b = 3
>>> b -= 1
>>> b
2
>>> a
11
>>> a = b = c = d = 10
>>> a += 1
>>>
>>> b -= 3
>>> c *= 10
>>> d /= 8
>>> a
11
>>> b
7
>>> c
100
>>> d
1.25
>>> 10 // 18
0
>>> 3.2 / 2
1.6
>>> 3.0 // 2
1.0
>>> 3.2 // 2
1.0
>>> 5 % 3
2
>>> 5 % 2
1
>>> 11 % 3
2
>>> 3 ** 2
9
>>> 2 ** 8
256
>>>


>>> -3 * 2 + 5 / -2 -4
-12.5
>>> (-3) * 2 + 5 / -2 -4
-12.5
>>> (((-3) * 2) + (5 / -2)) -4
-12.5

>>> 3 < 5 and 4 < 5
True
>>> (3 < 5) and (4 < 5)    #添加括号可提高代码的可读性
True

>>> -3 ** 2
-9
>>> -(3 ** 2)
-9
>>> 3 ** -1
0.3333333333333333
>>> 3 ** -2
0.1111111111111111

>>> 3 ** (-2)
0.1111111111111111

#逻辑操作符
and 两边为真
or 或者两边任意为真
not
>>> not True
False
>>> not False
True
>>> not 0
True
>>> not 4   正数为True
False

>>> 3 < 4 < 5
True
>>> 3 < 4 and 4 < 5
True

优先级：
幂运算     **
正负号    +x -x
自述操作符   * / // + -
比较操作符   <    <=    >   >=   ==     !=
逻辑运算符   not   and   or

